In [1]:
###################################################
#
#  ORDERS!
#
###################################################

# This data is a set of "orders" taken by a fictional
# online store that sells model cars. Each order
# can consist of multiple "line items", or multiple
# products. 
#
# Each product is sold for a given price per unit and
# each customer can buy multiple units of each product.
#
# City and country refer to the customer's city/country.

In [2]:
#
# 1) 
# Read in the `orders.json` as a list of dictionaries.
# Take a look at one of the dictionaries and note 
# the format. 


import json

with open('orders.json') as f:
    dat = [json.loads(l) for l in f]

In [3]:
#
# 2) 
# Draw out for yourself a set of databases schemas
# that fulfill the 3rd-normalized-form requirements
# to store this data.
# 
# Transform the data into pandas dataframes
# that reflect the tables you would store in 
# a database in 3NF.
#
# Make sure to state which column(s) are the PK!
# (it could be the index!)

import pandas as pd

def filter_keys(d, keys):
    return {k:v for k, v in d.items() if k in keys}

def customers(dat):
    keys = ['customer_name', 'customer_number', 'city', 'country']
    dat = [filter_keys(order, keys)
           for order in dat]
    return pd.DataFrame(dat)
    
# PK is customer_number
customers(dat)

     customer_number                 customer_name        city  country
0                363  Online Diecast Creations Co.      Nashua      USA
1                128          Blauer See Auto, Co.   Frankfurt  Germany
2                181               Vitachrome Inc.         NYC      USA
3                121            Baane Mini Imports     Stavern   Norway
4                141        Euro+ Shopping Channel      Madrid    Spain
..               ...                           ...         ...      ...
321              124  Mini Gifts Distributors Ltd.  San Rafael      USA
322              157         Diecast Classics Inc.   Allentown      USA
323              314                    Petit Auto   Bruxelles  Belgium
324              141        Euro+ Shopping Channel      Madrid    Spain
325              119             La Rochelle Gifts      Nantes   France

[326 rows x 4 columns]

In [4]:
def orders(dat):
    keys = ['order_number', 'order_date', 'customer_number']

    dat = [filter_keys(order, keys) for order in dat]
    return pd.DataFrame(dat)

# PK is order_number
orders(dat)

     customer_number  order_number  order_date
0                363         10100  2003-01-06
1                128         10101  2003-01-09
2                181         10102  2003-01-10
3                121         10103  2003-01-29
4                141         10104  2003-01-31
..               ...           ...         ...
321              124         10421  2005-05-29
322              157         10422  2005-05-30
323              314         10423  2005-05-30
324              141         10424  2005-05-31
325              119         10425  2005-05-31

[326 rows x 3 columns]

In [5]:
def order_items(dat):
    dat = [{'order_number': order['order_number'], **item} 
           for order in dat for item in order['items']]
    return pd.DataFrame(dat)

# PK could be compound (order_number, product_code)
order_items(dat)

,order_number,product_code,quantity_ordered,price_each,order_line_number
0,10100,S18_1749,30,136.00,3
1,10100,S18_2248,50,55.09,2
2,10100,S18_4409,22,75.46,4
3,10100,S24_3969,49,35.29,1
4,10101,S18_2325,25,108.06,4
...,...,...,...,...,...
2991,10425,S24_2300,49,127.79,9
2992,10425,S24_2840,31,31.82,5
2993,10425,S32_1268,41,83.79,11
2994,10425,S32_2509,11,50.32,6
2995,10425,S50_1392,18,94.92,2